
## Задача 1. Разделяй и властвуй. 

**Условие:**  
При работе с большими объёмами данных (например, при чтении файлов, обработке результатов базы данных или потоковой передаче) часто бывает неэффективно или невозможно загружать всё содержимое в память сразу. В таких случаях данные обрабатывают **порциями (чанками)** — небольшими группами элементов, которые помещаются в память и позволяют выполнять обработку поэтапно, не перегружая систему.

Реализуйте функцию `chunked(iterable, size)`, которая принимает на вход **итерируемый объект** и **целое положительное число `size`**, и возвращает **генератор**, выдающий элементы исходного объекта **порциями по `size` элементов**.

- Каждый чанк должен быть представлен в виде **кортежа**;
- Последний чанк может содержать **меньше элементов**, если размер исходного итерируемого объекта не делится нацело на `size`;
- Если исходный итерируемый объект пуст, генератор не должен выдавать ни одного чанка.

Допишите код в файле [task1](../../solutions/lesson12/task1.py).

**Входные данные:**
- `iterable` — любой итерируемый объект  
- `size` — целое число, `size ≥ 1`

**Выходные данные:**  
- Генератор, последовательно возвращающий кортежи длиной `size` (кроме, возможно, последнего)

**Примеры:**

```python
tuple(chunked([1, 2, 3, 4, 5], 2))
# → ((1, 2), (3, 4), (5))

tuple(chunked("abcdef", 3))
# → (('a', 'b', 'c'), ('d', 'e', 'f'))

tuple(chunked(range(10), 4))
# → ((0, 1, 2, 3), (4, 5, 6, 7), (8, 9))
```

**Примечание:** Использование внешних библиотек (например, `itertools.batched`) запрещено.

## Задача 2. Замкнутый круг

**Условие:**
    
Реализуйте функцию, которая на вход получает итерируемый объект и возвращает циклический генератор.

Допишите код в файле [task2](../../solutions/lesson12/task2.py).

**Входные данные:**

Любой итерируемый объект, в том числе и неограниченный.

**Выходные данные:**  

Генератор. На i-ый вызов функции `next` от созданного генератора должен вернуться `i%N`-ый элементы исходного итерируемого объекта, где `N` - количество элементов во входном итерируемом объекте. Если `N` - $\infty$, `i%N`-ый элемент - это элемент под номером `i`.

**Примеры:**

```python
circle_gen = circle("abc")

for i in range(5):
    print(next(circle_gen))
# a
# b
# c
# a
# b
```

**Примечание:** Использование внешних библиотек (например, `itertools.cycle`) запрещено.
    
## Задача 3. Пункт назначения

В объекте `stdout` встроенного модуля `sys` хранится объект, в который интерпретатор записывает результат выполнения функции `print()`, а также промпты, которые печатает функция `input()`. Заменив объект `sys.stdout` мы можем изменить буфер, в который будут писаться наши сообщения. Например, мы можем изменить пункт назначения сообщений со стандартного потока вывода на файл следующим образом:

```python
import sys

file = open("out.txt", "w")
stdout = sys.stdout
sys.stdout = file
print("Hello!")
sys.stdout = stdout
file.close()
```

В данном примере, до тех пор, пока `sys.stdout` не будет возвращено изначальное значение, все сообщения будут записываться в файл `out.txt`. Однако, очевидно, данный подход обладает существенными недостатками. Если в процессе записи произойдет какое-либо исключение, мы не вернем `sys.stdout` первоначальное значение, и последующие результаты выполнения функций `print()` продолжат писаться в `out.txt`. Более того, если случится исключение, мы не закроем файловый дескриптор файла `out.txt`, а, следовательно, потеряем часть данных и столкнемся с проблемами похуже, в виде утечек памяти.

Чтобы этого избежать, логичнее было бы разработать контекстный менеджер, который бы инкапсулировал бы логику работы с файлами и логику с заменой объекта `sys.stdout`, а также обеспечивал бы безопасную работу с ресурсами:

```python
with FileOut("test.txt") as file_manager:
    print(
        "Hello, World!",
        "This text must be printed into file",
        sep="\n",
    )
```
Допишите код в файле [task3](../../solutions/lesson12/task3.py).

**Вход**:

- На вход конструктору контекстного менеджера `FileOut` передается `path_to_file` - путь до файла, в который будет перенаправлен вывод.


